In [1]:
import numpy as np
import pandas as pd
pd.__version__

'1.1.1'

In [2]:
#Series initialization
c = pd.Series([54, 98, 569, 2345, 56])
c

0      54
1      98
2     569
3    2345
4      56
dtype: int64

In [3]:
c.values

array([  54,   98,  569, 2345,   56], dtype=int64)

In [4]:
c.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
weight = pd.Series([113,54,84,58,57,51,58,86,88], 
    index=['Max','Anuj','Arindam','Manvi','Rinu','Meghna','Likth','Praveen','Javeria'])

print("Series: \n{}\nValues: \n{}\nIndex: \n{}\nIndexing: \n{}\nNumber Indexing: \n{}".format
      (weight, weight.values, weight.index, weight['Arindam'], weight[2]))

Series:
Max        113
Anuj        54
Arindam     84
Manvi       58
Rinu        57
Meghna      51
Likth       58
Praveen     86
Javeria     88
dtype: int64
Values:
[113  54  84  58  57  51  58  86  88]
Index:
Index(['Max', 'Anuj', 'Arindam', 'Manvi', 'Rinu', 'Meghna', 'Likth', 'Praveen',
       'Javeria'],
      dtype='object')
Indexing:
84
Number Indexing:
84

In [6]:
weight.index.name = 'Name'
weight.name = 'Weight'
weight

Name
Max        113
Anuj        54
Arindam     84
Manvi       58
Rinu        57
Meghna      51
Likth       58
Praveen     86
Javeria     88
Name: Weight, dtype: int64

We can also filter according to the values in the `Series`:

In [16]:
#Boolean indexing
weight[weight>50][weight<60]

Name
Anuj      54
Manvi     58
Rinu      57
Meghna    51
Likth     58
Name: Weight, dtype: int64

In [8]:
weight_dict = {'Max': 32, 'Praveen': 50, 'Iftar': 56, 'Anuj': 89}
pd.Series(weight_dict)

Max        32
Praveen    50
Iftar      56
Anuj       89
dtype: int64

In [9]:
#Multi-Dimensional Dataframe
bio = {"Name": ['Max','Anuj','Arindam','Manvi','Rinu','Meghna','Likth','Praveen','Javeria'],
        "Year": [2013, 2014, 2013, 2014, 2014, 2015, 2019, 1999, 2000],
        "Weight": [113,54,84,58,57,51,58,86,88]}
bio = pd.DataFrame(bio)
bio

      Name  Year  Weight
0      Max  2013     113
1     Anuj  2014      54
2  Arindam  2013      84
3    Manvi  2014      58
4     Rinu  2014      57
5   Meghna  2015      51
6    Likth  2019      58
7  Praveen  1999      86
8  Javeria  2000      88

In [10]:
#Re-ordering column names
df = pd.DataFrame(bio, columns=["Year", "Name" ,"Weight"])
df

   Year     Name  Weight
0  2013      Max     113
1  2014     Anuj      54
2  2013  Arindam      84
3  2014    Manvi      58
4  2014     Rinu      57
5  2015   Meghna      51
6  2019    Likth      58
7  1999  Praveen      86
8  2000  Javeria      88

In [11]:
#Adding new columns
df['Age'] = 2020-df.Year
df

   Year     Name  Weight  Age
0  2013      Max     113    7
1  2014     Anuj      54    6
2  2013  Arindam      84    7
3  2014    Manvi      58    6
4  2014     Rinu      57    6
5  2015   Meghna      51    5
6  2019    Likth      58    1
7  1999  Praveen      86   21
8  2000  Javeria      88   20

In [12]:
#Converting to dict
df.to_dict()

{'Year': {0: 2013,
  1: 2014,
  2: 2013,
  3: 2014,
  4: 2014,
  5: 2015,
  6: 2019,
  7: 1999,
  8: 2000},
 'Name': {0: 'Max',
  1: 'Anuj',
  2: 'Arindam',
  3: 'Manvi',
  4: 'Rinu',
  5: 'Meghna',
  6: 'Likth',
  7: 'Praveen',
  8: 'Javeria'},
 'Weight': {0: 113, 1: 54, 2: 84, 3: 58, 4: 57, 5: 51, 6: 58, 7: 86, 8: 88},
 'Age': {0: 7, 1: 6, 2: 7, 3: 6, 4: 6, 5: 5, 6: 1, 7: 21, 8: 20}}

In [13]:
#From a list of dictionaries
even = [{'Number': i, 'Even':i%2==0}for i in range(20)]
print(even)
pd.DataFrame(even)

[{'Number': 0, 'Even': True}, {'Number': 1, 'Even': False}, {'Number': 2, 'Even': True}, {'Number': 3, 'Even': False}, {'Number': 4, 'Even': True}, {'Number': 5, 'Even': False}, {'Number': 6, 'Even': True}, {'Number': 7, 'Even': False}, {'Number': 8, 'Even': True}, {'Number': 9, 'Even': False}, {'Number': 10, 'Even': True}, {'Number': 11, 'Even': False}, {'Number': 12, 'Even': True}, {'Number': 13, 'Even': False}, {'Number': 14, 'Even': True}, {'Number': 15, 'Even': False}, {'Number': 16, 'Even': True}, {'Number': 17, 'Even': False}, {'Number': 18, 'Even': True}, {'Number': 19, 'Even': False}]

    Number   Even
0        0   True
1        1  False
2        2   True
3        3  False
4        4   True
5        5  False
6        6   True
7        7  False
8        8   True
9        9  False
10      10   True
11      11  False
12      12   True
13      13  False
14      14   True
15      15  False
16      16   True
17      17  False
18      18   True
19      19  False

In [14]:
#NaN represent missing values
pd.DataFrame([{'a': 1, 'b': 1}, {'b': 2, 'c': 2}])

     a  b    c
0  1.0  1  NaN
1  NaN  2  2.0